[
  {
    "price": 3500,
    "picture": "https://i.ibb.co/y5c7LWw/guide.jpg",
    "title": "Tour Guide & Photography",
    "description": "I ensure that itineraries are met and that customers are being informed in an entertaining manner the location they are touring and also capturing the moments into the frame. I have experience in traveling 50+ countries. I enjoy traveling with my camera and working as a guide. If you need a photographer with traveling experience you can contact with me.\r\n",
    "ratings": "5.00"
  },
  {
    "price": 2800,
    "picture": "https://i.ibb.co/KzBPq8F/corporateevent.jpg",
    "title": "Corporate Event Photography",
    "description": "Corporate event photography is a vital element of promoting your event & encouraging people to attend. With the increasing popularity of image-based digital platforms like Instagram & Facebook the whole world is now extremely visual. With this in mind, visually depicting your event is key for effective marketing – if your photos aren’t captivating how will you entice people to attend? An event photographer is there to capture the people, place, actions, emotions & reactions, providing high quality, professional images that can be used across a variety of different media platforms.\r\n",
    "ratings": "4.5"
  },
  {
    "price": 2200,
    "picture": "https://i.ibb.co/XpZZ7cV/wedding.jpg",
    "title": "Wedding Photography",
    "description": "I have provided wedding photography and videography services to brides and grooms for 30+ years. During that time. When planning your wedding, you might be looking for affordable wedding photography prices or packages. Wedding photographer packages come in many different forms and formats. Additionally, this variety can make it very difficult to differentiate between services. Not to mention, many companies do not get into quality which is as important as your investment.\r\n",
    "ratings": "4.7"
  },
  {
    "price": 1500,
    "picture": "https://i.ibb.co/0KHmwr9/specialevent.jpg",
    "title": "Special Event Photography",
    "description": "Event photography collects various shots showing different emotions and highlighting key parts of the event. Photography can easily provide that evidence. For example, one of your family-friendly events might be an anniversary celebration, a graduation party, a celebration of life party, your child’s first birthday, or a housewarming party. The list can be longer and longer. Life is full of the moments that should be celebrated! These moments will never be the same a second time around! That’s why you need to capture the moments. Since these photos can explore the moments and feelings for future generations. I have large time experience in this field.\r\n",
    "ratings": "4.8"
  },
  {
    "price": 5400,
    "picture": "https://i.ibb.co/5vGHRrz/eventmanage.jpg",
    "title": "Event Mangement & Photography",
    "description": "Now adays managing event is a hard task. There are lot of resposibilities that manage perfectly to make memorable event. I have a large team with experience of 30+ event managing and i am a proffesional photographer. So making your event memorable and capturing the beautiful moments is become easier. You can leave the tasks for proffesional and make your event day more memorable.\r\n",
    "ratings": "4.5"
  },
  {
    "price": 4000,
    "picture": "https://i.ibb.co/tP3JbYh/travelmanage.jpg",
    "title": "Travel Management & Photography",
    "description": "I ensure that itineraries are met and that customers are being informed in an entertaining manner the location they are touring and also capturing the moments into the frame. I have experience in traveling 50+ countries. I know how to make a successful travel with full of enjoy. I can arrange your dream travel destintions and other things like staying in hotels traveling one place to another.\r\n",
    "ratings": "4.3"
  }
]
